In [1]:
import pandas as pd

# Use converters to modify any cell value of a column

In [5]:
def convert_people_cell(cell):
    if cell == "n.a.":
        return "sam walton"
    return cell   

df = pd.read_excel("04_read_write_excel.xlsx", "Sheet1", converters = {
    'people': convert_people_cell
})
df

   tickers  eps  revenue      people
0   google   22     3343  larry page
1  walmart  221      453  sam walton
2     tata  122     4565  ratan tata

# to write above dataset to excel

In [8]:
df.to_excel("04_write_excel.xlsx", sheet_name = "abc", index = False)

   tickers  eps  revenue      people
0   google   22     3343  larry page
1  walmart  221      453  sam walton
2     tata  122     4565  ratan tata

# to write datatsets into 2 different sheets of a same excel file

In [10]:
df_stocks = pd.DataFrame({
    'tickers':['wat', 'ggl'],
    'price':   [100 ,2000]
})

df_weather = pd.DataFrame({
    'city': ['jal', 'asr'],
    'weather': ['sunny', 'rainy']
})

with pd.ExcelWriter('04_writing_multiple_sheets.xlsx') as writer:
    df_stocks.to_excel(writer, sheet_name="stocks")
    df_weather.to_excel(writer, sheet_name="weather")